{"class_name": "Model", "keras_version": "1.2.2", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 20, 225], "input_dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "initial_conv2D", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_uniform", "bias": false, "nb_filter": 4, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["input_1", 0, 0]]], "name": "initial_conv2D"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "name": "batchnormalization_1", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["initial_conv2D", 0, 0]]], "name": "batchnormalization_1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "inbound_nodes": [[["batchnormalization_1", 0, 0]]], "name": "activation_1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_1", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_uniform", "bias": false, "nb_filter": 4, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["activation_1", 0, 0]]], "name": "convolution2d_1"}, {"class_name": "Merge", "config": {"name": "merge_1", "concat_axis": 1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["initial_conv2D", 0, 0], ["convolution2d_1", 0, 0]]], "name": "merge_1"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "name": "batchnormalization_2", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["merge_1", 0, 0]]], "name": "batchnormalization_2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "inbound_nodes": [[["batchnormalization_2", 0, 0]]], "name": "activation_2"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_2", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_uniform", "bias": false, "nb_filter": 4, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["activation_2", 0, 0]]], "name": "convolution2d_2"}, {"class_name": "Merge", "config": {"name": "merge_2", "concat_axis": 1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["initial_conv2D", 0, 0], ["convolution2d_1", 0, 0], ["convolution2d_2", 0, 0]]], "name": "merge_2"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "name": "batchnormalization_3", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["merge_2", 0, 0]]], "name": "batchnormalization_3"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}, "inbound_nodes": [[["batchnormalization_3", 0, 0]]], "name": "activation_3"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_3", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_uniform", "bias": false, "nb_filter": 4, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["activation_3", 0, 0]]], "name": "convolution2d_3"}, {"class_name": "Merge", "config": {"name": "merge_3", "concat_axis": 1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["initial_conv2D", 0, 0], ["convolution2d_1", 0, 0], ["convolution2d_2", 0, 0], ["convolution2d_3", 0, 0]]], "name": "merge_3"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "name": "batchnormalization_4", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["merge_3", 0, 0]]], "name": "batchnormalization_4"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}, "inbound_nodes": [[["batchnormalization_4", 0, 0]]], "name": "activation_4"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_4", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_uniform", "bias": false, "nb_filter": 4, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["activation_4", 0, 0]]], "name": "convolution2d_4"}, {"class_name": "Merge", "config": {"name": "merge_4", "concat_axis": 1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["initial_conv2D", 0, 0], ["convolution2d_1", 0, 0], ["convolution2d_2", 0, 0], ["convolution2d_3", 0, 0], ["convolution2d_4", 0, 0]]], "name": "merge_4"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "name": "batchnormalization_5", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["merge_4", 0, 0]]], "name": "batchnormalization_5"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_5"}, "inbound_nodes": [[["batchnormalization_5", 0, 0]]], "name": "activation_5"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_5", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_uniform", "bias": false, "nb_filter": 4, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["activation_5", 0, 0]]], "name": "convolution2d_5"}, {"class_name": "Merge", "config": {"name": "merge_5", "concat_axis": 1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["initial_conv2D", 0, 0], ["convolution2d_1", 0, 0], ["convolution2d_2", 0, 0], ["convolution2d_3", 0, 0], ["convolution2d_4", 0, 0], ["convolution2d_5", 0, 0]]], "name": "merge_5"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "name": "batchnormalization_6", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["merge_5", 0, 0]]], "name": "batchnormalization_6"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_6"}, "inbound_nodes": [[["batchnormalization_6", 0, 0]]], "name": "activation_6"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_6", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_uniform", "bias": false, "nb_filter": 4, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["activation_6", 0, 0]]], "name": "convolution2d_6"}, {"class_name": "Merge", "config": {"name": "merge_6", "concat_axis": 1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["initial_conv2D", 0, 0], ["convolution2d_1", 0, 0], ["convolution2d_2", 0, 0], ["convolution2d_3", 0, 0], ["convolution2d_4", 0, 0], ["convolution2d_5", 0, 0], ["convolution2d_6", 0, 0]]], "name": "merge_6"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "name": "batchnormalization_7", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["merge_6", 0, 0]]], "name": "batchnormalization_7"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_7"}, "inbound_nodes": [[["batchnormalization_7", 0, 0]]], "name": "activation_7"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_7", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_uniform", "bias": false, "nb_filter": 4, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["activation_7", 0, 0]]], "name": "convolution2d_7"}, {"class_name": "Merge", "config": {"name": "merge_7", "concat_axis": 1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["initial_conv2D", 0, 0], ["convolution2d_1", 0, 0], ["convolution2d_2", 0, 0], ["convolution2d_3", 0, 0], ["convolution2d_4", 0, 0], ["convolution2d_5", 0, 0], ["convolution2d_6", 0, 0], ["convolution2d_7", 0, 0]]], "name": "merge_7"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "name": "batchnormalization_8", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["merge_7", 0, 0]]], "name": "batchnormalization_8"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_8"}, "inbound_nodes": [[["batchnormalization_8", 0, 0]]], "name": "activation_8"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_8", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_uniform", "bias": false, "nb_filter": 4, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["activation_8", 0, 0]]], "name": "convolution2d_8"}, {"class_name": "Merge", "config": {"name": "merge_8", "concat_axis": 1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["initial_conv2D", 0, 0], ["convolution2d_1", 0, 0], ["convolution2d_2", 0, 0], ["convolution2d_3", 0, 0], ["convolution2d_4", 0, 0], ["convolution2d_5", 0, 0], ["convolution2d_6", 0, 0], ["convolution2d_7", 0, 0], ["convolution2d_8", 0, 0]]], "name": "merge_8"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "name": "batchnormalization_9", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["merge_8", 0, 0]]], "name": "batchnormalization_9"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_9"}, "inbound_nodes": [[["batchnormalization_9", 0, 0]]], "name": "activation_9"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_9", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_uniform", "bias": false, "nb_filter": 4, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["activation_9", 0, 0]]], "name": "convolution2d_9"}, {"class_name": "Merge", "config": {"name": "merge_9", "concat_axis": 1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["initial_conv2D", 0, 0], ["convolution2d_1", 0, 0], ["convolution2d_2", 0, 0], ["convolution2d_3", 0, 0], ["convolution2d_4", 0, 0], ["convolution2d_5", 0, 0], ["convolution2d_6", 0, 0], ["convolution2d_7", 0, 0], ["convolution2d_8", 0, 0], ["convolution2d_9", 0, 0]]], "name": "merge_9"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "name": "batchnormalization_10", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["merge_9", 0, 0]]], "name": "batchnormalization_10"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_10"}, "inbound_nodes": [[["batchnormalization_10", 0, 0]]], "name": "activation_10"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_10", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_uniform", "bias": false, "nb_filter": 4, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["activation_10", 0, 0]]], "name": "convolution2d_10"}, {"class_name": "Merge", "config": {"name": "merge_10", "concat_axis": 1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["initial_conv2D", 0, 0], ["convolution2d_1", 0, 0], ["convolution2d_2", 0, 0], ["convolution2d_3", 0, 0], ["convolution2d_4", 0, 0], ["convolution2d_5", 0, 0], ["convolution2d_6", 0, 0], ["convolution2d_7", 0, 0], ["convolution2d_8", 0, 0], ["convolution2d_9", 0, 0], ["convolution2d_10", 0, 0]]], "name": "merge_10"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "name": "batchnormalization_11", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["merge_10", 0, 0]]], "name": "batchnormalization_11"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_11"}, "inbound_nodes": [[["batchnormalization_11", 0, 0]]], "name": "activation_11"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_11", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_uniform", "bias": false, "nb_filter": 4, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["activation_11", 0, 0]]], "name": "convolution2d_11"}, {"class_name": "Merge", "config": {"name": "merge_11", "concat_axis": 1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["initial_conv2D", 0, 0], ["convolution2d_1", 0, 0], ["convolution2d_2", 0, 0], ["convolution2d_3", 0, 0], ["convolution2d_4", 0, 0], ["convolution2d_5", 0, 0], ["convolution2d_6", 0, 0], ["convolution2d_7", 0, 0], ["convolution2d_8", 0, 0], ["convolution2d_9", 0, 0], ["convolution2d_10", 0, 0], ["convolution2d_11", 0, 0]]], "name": "merge_11"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "name": "batchnormalization_12", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["merge_11", 0, 0]]], "name": "batchnormalization_12"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_12"}, "inbound_nodes": [[["batchnormalization_12", 0, 0]]], "name": "activation_12"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_12", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_uniform", "bias": false, "nb_filter": 4, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["activation_12", 0, 0]]], "name": "convolution2d_12"}, {"class_name": "Merge", "config": {"name": "merge_12", "concat_axis": 1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["initial_conv2D", 0, 0], ["convolution2d_1", 0, 0], ["convolution2d_2", 0, 0], ["convolution2d_3", 0, 0], ["convolution2d_4", 0, 0], ["convolution2d_5", 0, 0], ["convolution2d_6", 0, 0], ["convolution2d_7", 0, 0], ["convolution2d_8", 0, 0], ["convolution2d_9", 0, 0], ["convolution2d_10", 0, 0], ["convolution2d_11", 0, 0], ["convolution2d_12", 0, 0]]], "name": "merge_12"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "name": "batchnormalization_13", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["merge_12", 0, 0]]], "name": "batchnormalization_13"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_13"}, "inbound_nodes": [[["batchnormalization_13", 0, 0]]], "name": "activation_13"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_13", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "he_uniform", "bias": false, "nb_filter": 52, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["activation_13", 0, 0]]], "name": "convolution2d_13"}, {"class_name": "AveragePooling2D", "config": {"name": "averagepooling2d_1", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["convolution2d_13", 0, 0]]], "name": "averagepooling2d_1"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "name": "batchnormalization_14", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["averagepooling2d_1", 0, 0]]], "name": "batchnormalization_14"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_14"}, "inbound_nodes": [[["batchnormalization_14", 0, 0]]], "name": "activation_14"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_14", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_uniform", "bias": false, "nb_filter": 4, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["activation_14", 0, 0]]], "name": "convolution2d_14"}, {"class_name": "Merge", "config": {"name": "merge_13", "concat_axis": 1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["averagepooling2d_1", 0, 0], ["convolution2d_14", 0, 0]]], "name": "merge_13"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "name": "batchnormalization_15", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["merge_13", 0, 0]]], "name": "batchnormalization_15"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_15"}, "inbound_nodes": [[["batchnormalization_15", 0, 0]]], "name": "activation_15"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_15", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_uniform", "bias": false, "nb_filter": 4, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["activation_15", 0, 0]]], "name": "convolution2d_15"}, {"class_name": "Merge", "config": {"name": "merge_14", "concat_axis": 1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["averagepooling2d_1", 0, 0], ["convolution2d_14", 0, 0], ["convolution2d_15", 0, 0]]], "name": "merge_14"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "name": "batchnormalization_16", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["merge_14", 0, 0]]], "name": "batchnormalization_16"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_16"}, "inbound_nodes": [[["batchnormalization_16", 0, 0]]], "name": "activation_16"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_16", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_uniform", "bias": false, "nb_filter": 4, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["activation_16", 0, 0]]], "name": "convolution2d_16"}, {"class_name": "Merge", "config": {"name": "merge_15", "concat_axis": 1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["averagepooling2d_1", 0, 0], ["convolution2d_14", 0, 0], ["convolution2d_15", 0, 0], ["convolution2d_16", 0, 0]]], "name": "merge_15"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "name": "batchnormalization_17", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["merge_15", 0, 0]]], "name": "batchnormalization_17"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_17"}, "inbound_nodes": [[["batchnormalization_17", 0, 0]]], "name": "activation_17"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_17", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_uniform", "bias": false, "nb_filter": 4, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["activation_17", 0, 0]]], "name": "convolution2d_17"}, {"class_name": "Merge", "config": {"name": "merge_16", "concat_axis": 1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["averagepooling2d_1", 0, 0], ["convolution2d_14", 0, 0], ["convolution2d_15", 0, 0], ["convolution2d_16", 0, 0], ["convolution2d_17", 0, 0]]], "name": "merge_16"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "name": "batchnormalization_18", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["merge_16", 0, 0]]], "name": "batchnormalization_18"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_18"}, "inbound_nodes": [[["batchnormalization_18", 0, 0]]], "name": "activation_18"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_18", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_uniform", "bias": false, "nb_filter": 4, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["activation_18", 0, 0]]], "name": "convolution2d_18"}, {"class_name": "Merge", "config": {"name": "merge_17", "concat_axis": 1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["averagepooling2d_1", 0, 0], ["convolution2d_14", 0, 0], ["convolution2d_15", 0, 0], ["convolution2d_16", 0, 0], ["convolution2d_17", 0, 0], ["convolution2d_18", 0, 0]]], "name": "merge_17"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "name": "batchnormalization_19", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["merge_17", 0, 0]]], "name": "batchnormalization_19"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_19"}, "inbound_nodes": [[["batchnormalization_19", 0, 0]]], "name": "activation_19"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_19", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_uniform", "bias": false, "nb_filter": 4, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["activation_19", 0, 0]]], "name": "convolution2d_19"}, {"class_name": "Merge", "config": {"name": "merge_18", "concat_axis": 1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["averagepooling2d_1", 0, 0], ["convolution2d_14", 0, 0], ["convolution2d_15", 0, 0], ["convolution2d_16", 0, 0], ["convolution2d_17", 0, 0], ["convolution2d_18", 0, 0], ["convolution2d_19", 0, 0]]], "name": "merge_18"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "name": "batchnormalization_20", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["merge_18", 0, 0]]], "name": "batchnormalization_20"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_20"}, "inbound_nodes": [[["batchnormalization_20", 0, 0]]], "name": "activation_20"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_20", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_uniform", "bias": false, "nb_filter": 4, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["activation_20", 0, 0]]], "name": "convolution2d_20"}, {"class_name": "Merge", "config": {"name": "merge_19", "concat_axis": 1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["averagepooling2d_1", 0, 0], ["convolution2d_14", 0, 0], ["convolution2d_15", 0, 0], ["convolution2d_16", 0, 0], ["convolution2d_17", 0, 0], ["convolution2d_18", 0, 0], ["convolution2d_19", 0, 0], ["convolution2d_20", 0, 0]]], "name": "merge_19"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "name": "batchnormalization_21", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["merge_19", 0, 0]]], "name": "batchnormalization_21"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_21"}, "inbound_nodes": [[["batchnormalization_21", 0, 0]]], "name": "activation_21"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_21", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_uniform", "bias": false, "nb_filter": 4, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["activation_21", 0, 0]]], "name": "convolution2d_21"}, {"class_name": "Merge", "config": {"name": "merge_20", "concat_axis": 1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["averagepooling2d_1", 0, 0], ["convolution2d_14", 0, 0], ["convolution2d_15", 0, 0], ["convolution2d_16", 0, 0], ["convolution2d_17", 0, 0], ["convolution2d_18", 0, 0], ["convolution2d_19", 0, 0], ["convolution2d_20", 0, 0], ["convolution2d_21", 0, 0]]], "name": "merge_20"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "name": "batchnormalization_22", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["merge_20", 0, 0]]], "name": "batchnormalization_22"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_22"}, "inbound_nodes": [[["batchnormalization_22", 0, 0]]], "name": "activation_22"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_22", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_uniform", "bias": false, "nb_filter": 4, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["activation_22", 0, 0]]], "name": "convolution2d_22"}, {"class_name": "Merge", "config": {"name": "merge_21", "concat_axis": 1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["averagepooling2d_1", 0, 0], ["convolution2d_14", 0, 0], ["convolution2d_15", 0, 0], ["convolution2d_16", 0, 0], ["convolution2d_17", 0, 0], ["convolution2d_18", 0, 0], ["convolution2d_19", 0, 0], ["convolution2d_20", 0, 0], ["convolution2d_21", 0, 0], ["convolution2d_22", 0, 0]]], "name": "merge_21"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "name": "batchnormalization_23", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["merge_21", 0, 0]]], "name": "batchnormalization_23"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_23"}, "inbound_nodes": [[["batchnormalization_23", 0, 0]]], "name": "activation_23"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_23", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_uniform", "bias": false, "nb_filter": 4, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["activation_23", 0, 0]]], "name": "convolution2d_23"}, {"class_name": "Merge", "config": {"name": "merge_22", "concat_axis": 1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["averagepooling2d_1", 0, 0], ["convolution2d_14", 0, 0], ["convolution2d_15", 0, 0], ["convolution2d_16", 0, 0], ["convolution2d_17", 0, 0], ["convolution2d_18", 0, 0], ["convolution2d_19", 0, 0], ["convolution2d_20", 0, 0], ["convolution2d_21", 0, 0], ["convolution2d_22", 0, 0], ["convolution2d_23", 0, 0]]], "name": "merge_22"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "name": "batchnormalization_24", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["merge_22", 0, 0]]], "name": "batchnormalization_24"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_24"}, "inbound_nodes": [[["batchnormalization_24", 0, 0]]], "name": "activation_24"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_24", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_uniform", "bias": false, "nb_filter": 4, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["activation_24", 0, 0]]], "name": "convolution2d_24"}, {"class_name": "Merge", "config": {"name": "merge_23", "concat_axis": 1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["averagepooling2d_1", 0, 0], ["convolution2d_14", 0, 0], ["convolution2d_15", 0, 0], ["convolution2d_16", 0, 0], ["convolution2d_17", 0, 0], ["convolution2d_18", 0, 0], ["convolution2d_19", 0, 0], ["convolution2d_20", 0, 0], ["convolution2d_21", 0, 0], ["convolution2d_22", 0, 0], ["convolution2d_23", 0, 0], ["convolution2d_24", 0, 0]]], "name": "merge_23"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "name": "batchnormalization_25", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["merge_23", 0, 0]]], "name": "batchnormalization_25"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_25"}, "inbound_nodes": [[["batchnormalization_25", 0, 0]]], "name": "activation_25"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_25", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_uniform", "bias": false, "nb_filter": 4, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["activation_25", 0, 0]]], "name": "convolution2d_25"}, {"class_name": "Merge", "config": {"name": "merge_24", "concat_axis": 1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["averagepooling2d_1", 0, 0], ["convolution2d_14", 0, 0], ["convolution2d_15", 0, 0], ["convolution2d_16", 0, 0], ["convolution2d_17", 0, 0], ["convolution2d_18", 0, 0], ["convolution2d_19", 0, 0], ["convolution2d_20", 0, 0], ["convolution2d_21", 0, 0], ["convolution2d_22", 0, 0], ["convolution2d_23", 0, 0], ["convolution2d_24", 0, 0], ["convolution2d_25", 0, 0]]], "name": "merge_24"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "name": "batchnormalization_26", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["merge_24", 0, 0]]], "name": "batchnormalization_26"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_26"}, "inbound_nodes": [[["batchnormalization_26", 0, 0]]], "name": "activation_26"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_26", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 1, "subsample": [1, 1], "init": "he_uniform", "bias": false, "nb_filter": 100, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 1}, "inbound_nodes": [[["activation_26", 0, 0]]], "name": "convolution2d_26"}, {"class_name": "AveragePooling2D", "config": {"name": "averagepooling2d_2", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["convolution2d_26", 0, 0]]], "name": "averagepooling2d_2"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "name": "batchnormalization_27", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["averagepooling2d_2", 0, 0]]], "name": "batchnormalization_27"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_27"}, "inbound_nodes": [[["batchnormalization_27", 0, 0]]], "name": "activation_27"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_27", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_uniform", "bias": false, "nb_filter": 4, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["activation_27", 0, 0]]], "name": "convolution2d_27"}, {"class_name": "Merge", "config": {"name": "merge_25", "concat_axis": 1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["averagepooling2d_2", 0, 0], ["convolution2d_27", 0, 0]]], "name": "merge_25"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "name": "batchnormalization_28", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["merge_25", 0, 0]]], "name": "batchnormalization_28"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_28"}, "inbound_nodes": [[["batchnormalization_28", 0, 0]]], "name": "activation_28"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_28", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_uniform", "bias": false, "nb_filter": 4, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["activation_28", 0, 0]]], "name": "convolution2d_28"}, {"class_name": "Merge", "config": {"name": "merge_26", "concat_axis": 1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["averagepooling2d_2", 0, 0], ["convolution2d_27", 0, 0], ["convolution2d_28", 0, 0]]], "name": "merge_26"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "name": "batchnormalization_29", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["merge_26", 0, 0]]], "name": "batchnormalization_29"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_29"}, "inbound_nodes": [[["batchnormalization_29", 0, 0]]], "name": "activation_29"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_29", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_uniform", "bias": false, "nb_filter": 4, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["activation_29", 0, 0]]], "name": "convolution2d_29"}, {"class_name": "Merge", "config": {"name": "merge_27", "concat_axis": 1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["averagepooling2d_2", 0, 0], ["convolution2d_27", 0, 0], ["convolution2d_28", 0, 0], ["convolution2d_29", 0, 0]]], "name": "merge_27"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "name": "batchnormalization_30", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["merge_27", 0, 0]]], "name": "batchnormalization_30"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_30"}, "inbound_nodes": [[["batchnormalization_30", 0, 0]]], "name": "activation_30"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_30", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_uniform", "bias": false, "nb_filter": 4, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["activation_30", 0, 0]]], "name": "convolution2d_30"}, {"class_name": "Merge", "config": {"name": "merge_28", "concat_axis": 1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["averagepooling2d_2", 0, 0], ["convolution2d_27", 0, 0], ["convolution2d_28", 0, 0], ["convolution2d_29", 0, 0], ["convolution2d_30", 0, 0]]], "name": "merge_28"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "name": "batchnormalization_31", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["merge_28", 0, 0]]], "name": "batchnormalization_31"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_31"}, "inbound_nodes": [[["batchnormalization_31", 0, 0]]], "name": "activation_31"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_31", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "he_uniform", "bias": false, "nb_filter": 4, "border_mode": "same", "b_regularizer": null, "W_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["activation_31", 0, 0]]], "name": "convolution2d_31"}, {"class_name": "Merge", "config": {"name": "merge_29", "concat_axis": 1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["averagepooling2d_2", 0, 0], ["convolution2d_27", 0, 0], ["convolution2d_28", 0, 0], ["convolution2d_29", 0, 0], ["convolution2d_30", 0, 0], ["convolution2d_31", 0, 0]]], "name": "merge_29"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": {"l2": 9.999999747378752e-05, "name": "L1L2Regularizer", "l1": 0.0}, "name": "batchnormalization_32", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": {"l2": 9.999999747378752e-05, "name": 